zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_STCU.h
/*
** ###################################################################
**     Processors:          MCXE32BMLL_cm7_core0
**                          MCXE32BMLL_cm7_core1
**                          MCXE32BMPB_cm7_core0
**                          MCXE32BMPB_cm7_core1
**
**     Version:             rev. 1.0, 2025-07-18
**     Build:               b260625
**
**     Abstract:
**         CMSIS Peripheral Access Layer for STCU
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2026 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 0.1 (2024-11-19)
**         Initial version.
**     - rev. 1.0 (2025-07-18)
**         Rev2 RM.
**
** ###################################################################
*/

/*!
 * @file PERI_STCU.h
 * @version 1.0
 * @date 2025-07-18
 * @brief CMSIS Peripheral Access Layer for STCU
 *
 * CMSIS Peripheral Access Layer for STCU
 */

#if !defined(PERI_STCU_H_)
#define PERI_STCU_H_                             /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MCXE32BMLL_cm7_core0) || defined(CPU_MCXE32BMPB_cm7_core0))
#include "MCXE32B_cm7_core0_COMMON.h"
#elif (defined(CPU_MCXE32BMLL_cm7_core1) || defined(CPU_MCXE32BMPB_cm7_core1))
#include "MCXE32B_cm7_core1_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- STCU Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup STCU_Peripheral_Access_Layer STCU Peripheral Access Layer
 * @{
 */

/** STCU - Size of Registers Arrays */
#define STCU_LB_COUNT                             1u
#define STCU_MB_CTRL_COUNT                        12u

/** STCU - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4];
  __IO uint32_t RUNSW;                             /**< STCU2 Run Software, offset: 0x4 */
  __O  uint32_t SKC;                               /**< STCU2 SK Code, offset: 0x8 */
  __IO uint32_t CFG;                               /**< STCU2 Configuration, offset: 0xC */
       uint8_t RESERVED_1[4];
  __IO uint32_t WDG;                               /**< STCU2 Watchdog Granularity, offset: 0x14 */
       uint8_t RESERVED_2[12];
  __IO uint32_t ERR_STAT;                          /**< STCU2 Error, offset: 0x24 */
  __IO uint32_t ERR_FM;                            /**< STCU2 Error FM, offset: 0x28 */
       uint8_t RESERVED_3[32];
  __I  uint32_t LBSSW0;                            /**< STCU2 Online LBIST Status, offset: 0x4C */
       uint8_t RESERVED_4[12];
  __I  uint32_t LBESW0;                            /**< STCU2 Online LBIST End Flag, offset: 0x5C */
       uint8_t RESERVED_5[28];
  __IO uint32_t LBUFM0;                            /**< STCU2 Online LBIST Unrecoverable FM, offset: 0x7C */
       uint8_t RESERVED_6[140];
  __I  uint32_t MBSSW0;                            /**< STCU2 Online MBIST Status, offset: 0x10C */
       uint8_t RESERVED_7[60];
  __I  uint32_t MBESW0;                            /**< STCU2 Online MBIST End Flag, offset: 0x14C */
       uint8_t RESERVED_8[60];
  __IO uint32_t MBUFM0;                            /**< STCU2 MBIST Unrecoverable FM, offset: 0x18C */
       uint8_t RESERVED_9[112];
  struct {                                         /* offset: 0x200, array step: 0x30 */
    __IO uint32_t CTRL;                              /**< STCU2 LBIST Control, array offset: 0x200, array step: 0x30 */
    __IO uint32_t PCS;                               /**< STCU2 LBIST PC Stop, array offset: 0x204, array step: 0x30 */
         uint8_t RESERVED_0[24];
    __IO uint32_t MISRELSW;                          /**< STCU2 Online LBIST MISR Expected Low, array offset: 0x220, array step: 0x30 */
    __IO uint32_t MISREHSW;                          /**< STCU2 Online LBIST MISR Expected High, array offset: 0x224, array step: 0x30 */
    __I  uint32_t MISRRLSW;                          /**< STCU2 Online LBIST MISR Read Low, array offset: 0x228, array step: 0x30 */
    __I  uint32_t MISRRHSW;                          /**< STCU2 Online LBIST MISR Read High, array offset: 0x22C, array step: 0x30 */
  } LB[STCU_LB_COUNT];
       uint8_t RESERVED_10[8144];
  __IO uint32_t ALGOSEL;                           /**< STCU2 Algorithm Select, offset: 0x2200 */
       uint8_t RESERVED_11[8];
  __IO uint32_t STGGR;                             /**< STCU2 MBIST Stagger, offset: 0x220C */
  __IO uint32_t BSTART;                            /**< STCU2 BIST Start, offset: 0x2210 */
  __IO uint32_t MB_CTRL[STCU_MB_CTRL_COUNT];       /**< STCU2 MBIST Control, array offset: 0x2214, array step: 0x4 */
} STCU_Type;

/* ----------------------------------------------------------------------------
   -- STCU Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup STCU_Register_Masks STCU Register Masks
 * @{
 */

/*! @name RUNSW - STCU2 Run Software */
/*! @{ */

#define STCU_RUNSW_RUNSW_MASK                    (0x1U)
#define STCU_RUNSW_RUNSW_SHIFT                   (0U)
/*! RUNSW
 *  0b0..Idle
 *  0b1..Online self-testing procedure is running
 */
#define STCU_RUNSW_RUNSW(x)                      (((uint32_t)(((uint32_t)(x)) << STCU_RUNSW_RUNSW_SHIFT)) & STCU_RUNSW_RUNSW_MASK)

#define STCU_RUNSW_LBSWPLLEN_MASK                (0x100U)
#define STCU_RUNSW_LBSWPLLEN_SHIFT               (8U)
/*! LBSWPLLEN
 *  0b0..Online LBIST is executed without using the on-chip PLL.
 *  0b1..Online LBIST is executed using the PLL configuration provided by the software. STCU2 does not take the
 *       PLL control but monitors the PLL lock signal to check if PLL is working correctly.
 */
#define STCU_RUNSW_LBSWPLLEN(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_RUNSW_LBSWPLLEN_SHIFT)) & STCU_RUNSW_LBSWPLLEN_MASK)

#define STCU_RUNSW_MBSWPLLEN_MASK                (0x200U)
#define STCU_RUNSW_MBSWPLLEN_SHIFT               (9U)
/*! MBSWPLLEN
 *  0b0..Online MBIST is executed without using the on-chip PLL.
 *  0b1..Online MBIST is executed using the PLL configuration provided by software. STCU2 does not take the PLL
 *       control but monitors the PLL lock signal to check if PLL is working correctly.
 */
#define STCU_RUNSW_MBSWPLLEN(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_RUNSW_MBSWPLLEN_SHIFT)) & STCU_RUNSW_MBSWPLLEN_MASK)
/*! @} */

