zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_STCU.h
#define STCU_ERR_FM_LOCKEUFM_MASK                (0x10U)
#define STCU_ERR_FM_LOCKEUFM_SHIFT               (4U)
/*! LOCKEUFM
 *  0b0..Recoverable Fault Mapping
 *  0b1..Unrecoverable Fault Mapping
 */
#define STCU_ERR_FM_LOCKEUFM(x)                  (((uint32_t)(((uint32_t)(x)) << STCU_ERR_FM_LOCKEUFM_SHIFT)) & STCU_ERR_FM_LOCKEUFM_MASK)
/*! @} */

/*! @name LBSSW0 - STCU2 Online LBIST Status */
/*! @{ */

#define STCU_LBSSW0_LBSSW0_MASK                  (0x1U)
#define STCU_LBSSW0_LBSSW0_SHIFT                 (0U)
/*! LBSSW0 - LBSSW0
 *  0b0..Failed LBIST execution
 *  0b1..Successful LBIST execution
 */
#define STCU_LBSSW0_LBSSW0(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBSSW0_LBSSW0_SHIFT)) & STCU_LBSSW0_LBSSW0_MASK)
/*! @} */

/*! @name LBESW0 - STCU2 Online LBIST End Flag */
/*! @{ */

#define STCU_LBESW0_LBESW0_MASK                  (0x1U)
#define STCU_LBESW0_LBESW0_SHIFT                 (0U)
/*! LBESW0 - LBESW
 *  0b0..LBIST execution not yet completed
 *  0b1..LBIST execution finished
 */
#define STCU_LBESW0_LBESW0(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBESW0_LBESW0_SHIFT)) & STCU_LBESW0_LBESW0_MASK)
/*! @} */

/*! @name LBUFM0 - STCU2 Online LBIST Unrecoverable FM */
/*! @{ */

#define STCU_LBUFM0_LBUFM0_MASK                  (0x1U)
#define STCU_LBUFM0_LBUFM0_SHIFT                 (0U)
/*! LBUFM0
 *  0b0..Recoverable Fault mapping
 *  0b1..Unrecoverable Fault mapping
 */
#define STCU_LBUFM0_LBUFM0(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_LBUFM0_LBUFM0_SHIFT)) & STCU_LBUFM0_LBUFM0_MASK)
/*! @} */

/*! @name MBSSW0 - STCU2 Online MBIST Status */
/*! @{ */

#define STCU_MBSSW0_MBSSW0_MASK                  (0x1U)
#define STCU_MBSSW0_MBSSW0_SHIFT                 (0U)
/*! MBSSW0 - MBSSW
 *  0b0..Failed MBIST execution
 *  0b1..No fault detected during the MBIST execution
 */
#define STCU_MBSSW0_MBSSW0(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW0_SHIFT)) & STCU_MBSSW0_MBSSW0_MASK)

#define STCU_MBSSW0_MBSSW1_MASK                  (0x2U)
#define STCU_MBSSW0_MBSSW1_SHIFT                 (1U)
/*! MBSSW1 - MBSSW
 *  0b0..Failed MBIST execution
 *  0b1..No fault detected during the MBIST execution
 */
#define STCU_MBSSW0_MBSSW1(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW1_SHIFT)) & STCU_MBSSW0_MBSSW1_MASK)

#define STCU_MBSSW0_MBSSW2_MASK                  (0x4U)
#define STCU_MBSSW0_MBSSW2_SHIFT                 (2U)
/*! MBSSW2 - MBSSW
 *  0b0..Failed MBIST execution
 *  0b1..No fault detected during the MBIST execution
 */
#define STCU_MBSSW0_MBSSW2(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW2_SHIFT)) & STCU_MBSSW0_MBSSW2_MASK)

#define STCU_MBSSW0_MBSSW3_MASK                  (0x8U)
#define STCU_MBSSW0_MBSSW3_SHIFT                 (3U)
/*! MBSSW3 - MBSSW
 *  0b0..Failed MBIST execution
 *  0b1..No fault detected during the MBIST execution
 */
#define STCU_MBSSW0_MBSSW3(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW3_SHIFT)) & STCU_MBSSW0_MBSSW3_MASK)

#define STCU_MBSSW0_MBSSW4_MASK                  (0x10U)
#define STCU_MBSSW0_MBSSW4_SHIFT                 (4U)
/*! MBSSW4 - MBSSW
 *  0b0..Failed MBIST execution
 *  0b1..No fault detected during the MBIST execution
 */
#define STCU_MBSSW0_MBSSW4(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW4_SHIFT)) & STCU_MBSSW0_MBSSW4_MASK)

#define STCU_MBSSW0_MBSSW5_MASK                  (0x20U)
#define STCU_MBSSW0_MBSSW5_SHIFT                 (5U)
/*! MBSSW5 - MBSSW
 *  0b0..Failed MBIST execution
 *  0b1..No fault detected during the MBIST execution
 */
#define STCU_MBSSW0_MBSSW5(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW5_SHIFT)) & STCU_MBSSW0_MBSSW5_MASK)

#define STCU_MBSSW0_MBSSW6_MASK                  (0x40U)
#define STCU_MBSSW0_MBSSW6_SHIFT                 (6U)
/*! MBSSW6 - MBSSW
 *  0b0..Failed MBIST execution
 *  0b1..No fault detected during the MBIST execution
 */
#define STCU_MBSSW0_MBSSW6(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW6_SHIFT)) & STCU_MBSSW0_MBSSW6_MASK)

#define STCU_MBSSW0_MBSSW7_MASK                  (0x80U)
#define STCU_MBSSW0_MBSSW7_SHIFT                 (7U)
/*! MBSSW7 - MBSSW
 *  0b0..Failed MBIST execution
 *  0b1..No fault detected during the MBIST execution
 */
#define STCU_MBSSW0_MBSSW7(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW7_SHIFT)) & STCU_MBSSW0_MBSSW7_MASK)

#define STCU_MBSSW0_MBSSW8_MASK                  (0x100U)
#define STCU_MBSSW0_MBSSW8_SHIFT                 (8U)
/*! MBSSW8 - MBSSW
 *  0b0..Failed MBIST execution
 *  0b1..No fault detected during the MBIST execution
 */
#define STCU_MBSSW0_MBSSW8(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW8_SHIFT)) & STCU_MBSSW0_MBSSW8_MASK)

#define STCU_MBSSW0_MBSSW9_MASK                  (0x200U)
#define STCU_MBSSW0_MBSSW9_SHIFT                 (9U)
/*! MBSSW9 - MBSSW
 *  0b0..Failed MBIST execution
 *  0b1..No fault detected during the MBIST execution
 */
#define STCU_MBSSW0_MBSSW9(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW9_SHIFT)) & STCU_MBSSW0_MBSSW9_MASK)

#define STCU_MBSSW0_MBSSW10_MASK                 (0x400U)
#define STCU_MBSSW0_MBSSW10_SHIFT                (10U)
/*! MBSSW10 - MBSSW
 *  0b0..Failed MBIST execution
 *  0b1..No fault detected during the MBIST execution
 */
#define STCU_MBSSW0_MBSSW10(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW10_SHIFT)) & STCU_MBSSW0_MBSSW10_MASK)

#define STCU_MBSSW0_MBSSW11_MASK                 (0x800U)
#define STCU_MBSSW0_MBSSW11_SHIFT                (11U)
/*! MBSSW11 - MBSSW
 *  0b0..Failed MBIST execution
 *  0b1..No fault detected during the MBIST execution
 */
#define STCU_MBSSW0_MBSSW11(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBSSW0_MBSSW11_SHIFT)) & STCU_MBSSW0_MBSSW11_MASK)
/*! @} */

/*! @name MBESW0 - STCU2 Online MBIST End Flag */
/*! @{ */

#define STCU_MBESW0_MBESW0_MASK                  (0x1U)
#define STCU_MBESW0_MBESW0_SHIFT                 (0U)
/*! MBESW0
 *  0b0..MBIST execution still ongoing
 *  0b1..MBIST execution finished
 */
#define STCU_MBESW0_MBESW0(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW0_SHIFT)) & STCU_MBESW0_MBESW0_MASK)

#define STCU_MBESW0_MBESW1_MASK                  (0x2U)
#define STCU_MBESW0_MBESW1_SHIFT                 (1U)
/*! MBESW1
 *  0b0..MBIST execution still ongoing
 *  0b1..MBIST execution finished
 */
#define STCU_MBESW0_MBESW1(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW1_SHIFT)) & STCU_MBESW0_MBESW1_MASK)

