zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_STCU.h
#define STCU_MBESW0_MBESW2_MASK                  (0x4U)
#define STCU_MBESW0_MBESW2_SHIFT                 (2U)
/*! MBESW2
 *  0b0..MBIST execution still ongoing
 *  0b1..MBIST execution finished
 */
#define STCU_MBESW0_MBESW2(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW2_SHIFT)) & STCU_MBESW0_MBESW2_MASK)

#define STCU_MBESW0_MBESW3_MASK                  (0x8U)
#define STCU_MBESW0_MBESW3_SHIFT                 (3U)
/*! MBESW3
 *  0b0..MBIST execution still ongoing
 *  0b1..MBIST execution finished
 */
#define STCU_MBESW0_MBESW3(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW3_SHIFT)) & STCU_MBESW0_MBESW3_MASK)

#define STCU_MBESW0_MBESW4_MASK                  (0x10U)
#define STCU_MBESW0_MBESW4_SHIFT                 (4U)
/*! MBESW4
 *  0b0..MBIST execution still ongoing
 *  0b1..MBIST execution finished
 */
#define STCU_MBESW0_MBESW4(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW4_SHIFT)) & STCU_MBESW0_MBESW4_MASK)

#define STCU_MBESW0_MBESW5_MASK                  (0x20U)
#define STCU_MBESW0_MBESW5_SHIFT                 (5U)
/*! MBESW5
 *  0b0..MBIST execution still ongoing
 *  0b1..MBIST execution finished
 */
#define STCU_MBESW0_MBESW5(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW5_SHIFT)) & STCU_MBESW0_MBESW5_MASK)

#define STCU_MBESW0_MBESW6_MASK                  (0x40U)
#define STCU_MBESW0_MBESW6_SHIFT                 (6U)
/*! MBESW6
 *  0b0..MBIST execution still ongoing
 *  0b1..MBIST execution finished
 */
#define STCU_MBESW0_MBESW6(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW6_SHIFT)) & STCU_MBESW0_MBESW6_MASK)

#define STCU_MBESW0_MBESW7_MASK                  (0x80U)
#define STCU_MBESW0_MBESW7_SHIFT                 (7U)
/*! MBESW7
 *  0b0..MBIST execution still ongoing
 *  0b1..MBIST execution finished
 */
#define STCU_MBESW0_MBESW7(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW7_SHIFT)) & STCU_MBESW0_MBESW7_MASK)

#define STCU_MBESW0_MBESW8_MASK                  (0x100U)
#define STCU_MBESW0_MBESW8_SHIFT                 (8U)
/*! MBESW8
 *  0b0..MBIST execution still ongoing
 *  0b1..MBIST execution finished
 */
#define STCU_MBESW0_MBESW8(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW8_SHIFT)) & STCU_MBESW0_MBESW8_MASK)

#define STCU_MBESW0_MBESW9_MASK                  (0x200U)
#define STCU_MBESW0_MBESW9_SHIFT                 (9U)
/*! MBESW9
 *  0b0..MBIST execution still ongoing
 *  0b1..MBIST execution finished
 */
#define STCU_MBESW0_MBESW9(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW9_SHIFT)) & STCU_MBESW0_MBESW9_MASK)

#define STCU_MBESW0_MBESW10_MASK                 (0x400U)
#define STCU_MBESW0_MBESW10_SHIFT                (10U)
/*! MBESW10
 *  0b0..MBIST execution still ongoing
 *  0b1..MBIST execution finished
 */
#define STCU_MBESW0_MBESW10(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW10_SHIFT)) & STCU_MBESW0_MBESW10_MASK)

#define STCU_MBESW0_MBESW11_MASK                 (0x800U)
#define STCU_MBESW0_MBESW11_SHIFT                (11U)
/*! MBESW11
 *  0b0..MBIST execution still ongoing
 *  0b1..MBIST execution finished
 */
#define STCU_MBESW0_MBESW11(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBESW0_MBESW11_SHIFT)) & STCU_MBESW0_MBESW11_MASK)
/*! @} */

/*! @name MBUFM0 - STCU2 MBIST Unrecoverable FM */
/*! @{ */

#define STCU_MBUFM0_MBUFM0_MASK                  (0x1U)
#define STCU_MBUFM0_MBUFM0_SHIFT                 (0U)
/*! MBUFM0 - MBESW
 *  0b0..Recoverable fault mapping
 *  0b1..Unrecoverable fault mapping
 */
#define STCU_MBUFM0_MBUFM0(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM0_SHIFT)) & STCU_MBUFM0_MBUFM0_MASK)

#define STCU_MBUFM0_MBUFM1_MASK                  (0x2U)
#define STCU_MBUFM0_MBUFM1_SHIFT                 (1U)
/*! MBUFM1 - MBESW
 *  0b0..Recoverable fault mapping
 *  0b1..Unrecoverable fault mapping
 */
#define STCU_MBUFM0_MBUFM1(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM1_SHIFT)) & STCU_MBUFM0_MBUFM1_MASK)

#define STCU_MBUFM0_MBUFM2_MASK                  (0x4U)
#define STCU_MBUFM0_MBUFM2_SHIFT                 (2U)
/*! MBUFM2 - MBESW
 *  0b0..Recoverable fault mapping
 *  0b1..Unrecoverable fault mapping
 */
#define STCU_MBUFM0_MBUFM2(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM2_SHIFT)) & STCU_MBUFM0_MBUFM2_MASK)

#define STCU_MBUFM0_MBUFM3_MASK                  (0x8U)
#define STCU_MBUFM0_MBUFM3_SHIFT                 (3U)
/*! MBUFM3 - MBESW
 *  0b0..Recoverable fault mapping
 *  0b1..Unrecoverable fault mapping
 */
#define STCU_MBUFM0_MBUFM3(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM3_SHIFT)) & STCU_MBUFM0_MBUFM3_MASK)

#define STCU_MBUFM0_MBUFM4_MASK                  (0x10U)
#define STCU_MBUFM0_MBUFM4_SHIFT                 (4U)
/*! MBUFM4 - MBESW
 *  0b0..Recoverable fault mapping
 *  0b1..Unrecoverable fault mapping
 */
#define STCU_MBUFM0_MBUFM4(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM4_SHIFT)) & STCU_MBUFM0_MBUFM4_MASK)

#define STCU_MBUFM0_MBUFM5_MASK                  (0x20U)
#define STCU_MBUFM0_MBUFM5_SHIFT                 (5U)
/*! MBUFM5 - MBESW
 *  0b0..Recoverable fault mapping
 *  0b1..Unrecoverable fault mapping
 */
#define STCU_MBUFM0_MBUFM5(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM5_SHIFT)) & STCU_MBUFM0_MBUFM5_MASK)

#define STCU_MBUFM0_MBUFM6_MASK                  (0x40U)
#define STCU_MBUFM0_MBUFM6_SHIFT                 (6U)
/*! MBUFM6 - MBESW
 *  0b0..Recoverable fault mapping
 *  0b1..Unrecoverable fault mapping
 */
#define STCU_MBUFM0_MBUFM6(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM6_SHIFT)) & STCU_MBUFM0_MBUFM6_MASK)

#define STCU_MBUFM0_MBUFM7_MASK                  (0x80U)
#define STCU_MBUFM0_MBUFM7_SHIFT                 (7U)
/*! MBUFM7 - MBESW
 *  0b0..Recoverable fault mapping
 *  0b1..Unrecoverable fault mapping
 */
#define STCU_MBUFM0_MBUFM7(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM7_SHIFT)) & STCU_MBUFM0_MBUFM7_MASK)

