zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_STCU.h
#define STCU_MBUFM0_MBUFM8_MASK                  (0x100U)
#define STCU_MBUFM0_MBUFM8_SHIFT                 (8U)
/*! MBUFM8 - MBESW
 *  0b0..Recoverable fault mapping
 *  0b1..Unrecoverable fault mapping
 */
#define STCU_MBUFM0_MBUFM8(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM8_SHIFT)) & STCU_MBUFM0_MBUFM8_MASK)

#define STCU_MBUFM0_MBUFM9_MASK                  (0x200U)
#define STCU_MBUFM0_MBUFM9_SHIFT                 (9U)
/*! MBUFM9 - MBESW
 *  0b0..Recoverable fault mapping
 *  0b1..Unrecoverable fault mapping
 */
#define STCU_MBUFM0_MBUFM9(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM9_SHIFT)) & STCU_MBUFM0_MBUFM9_MASK)

#define STCU_MBUFM0_MBUFM10_MASK                 (0x400U)
#define STCU_MBUFM0_MBUFM10_SHIFT                (10U)
/*! MBUFM10 - MBESW
 *  0b0..Recoverable fault mapping
 *  0b1..Unrecoverable fault mapping
 */
#define STCU_MBUFM0_MBUFM10(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM10_SHIFT)) & STCU_MBUFM0_MBUFM10_MASK)

#define STCU_MBUFM0_MBUFM11_MASK                 (0x800U)
#define STCU_MBUFM0_MBUFM11_SHIFT                (11U)
/*! MBUFM11 - MBESW
 *  0b0..Recoverable fault mapping
 *  0b1..Unrecoverable fault mapping
 */
#define STCU_MBUFM0_MBUFM11(x)                   (((uint32_t)(((uint32_t)(x)) << STCU_MBUFM0_MBUFM11_SHIFT)) & STCU_MBUFM0_MBUFM11_MASK)
/*! @} */

/*! @name CTRL - STCU2 LBIST Control */
/*! @{ */

#define STCU_CTRL_CWS_MASK                       (0x3FU)
#define STCU_CTRL_CWS_SHIFT                      (0U)
/*! CWS
 *  0b000000..Illegal
 *  0b000001..Controller waits 1 shift cycle for capture to finish.
 *  0b000010..Controller waits 2 shift cycles for capture to finish.
 *  0b000011..Controller waits 3 shift cycles for capture to finish.
 *  0b000100..Controller waits 4 shift cycles for capture to finish.
 *  0b000101..Controller waits 5 shift cycles for capture to finish.
 *  0b000110..Controller waits 6 shift cycles for capture to finish.
 *  0b000111..Controller waits 7 shift cycles for capture to finish.
 */
#define STCU_CTRL_CWS(x)                         (((uint32_t)(((uint32_t)(x)) << STCU_CTRL_CWS_SHIFT)) & STCU_CTRL_CWS_MASK)

#define STCU_CTRL_SCEN_ON_MASK                   (0xF00U)
#define STCU_CTRL_SCEN_ON_SHIFT                  (8U)
/*! SCEN_ON
 *  0b0000..0 delay cycles
 *  0b0001..1 delay cycle
 *  0b0010..2 delay cycles
 *  0b0011..3 delay cycles
 *  0b0100..4 delay cycles
 *  0b0101..5 delay cycles
 *  0b0110..6 delay cycles
 *  0b0111..7 delay cycles
 *  0b1000..8 delay cycles
 *  0b1001..9 delay cycles
 *  0b1010..10 delay cycles
 *  0b1011..11 delay cycles
 *  0b1100..12 delay cycles
 *  0b1101..13 delay cycles
 *  0b1110..14 delay cycles
 *  0b1111..15 delay cycles
 */
#define STCU_CTRL_SCEN_ON(x)                     (((uint32_t)(((uint32_t)(x)) << STCU_CTRL_SCEN_ON_SHIFT)) & STCU_CTRL_SCEN_ON_MASK)

#define STCU_CTRL_SCEN_OFF_MASK                  (0xF000U)
#define STCU_CTRL_SCEN_OFF_SHIFT                 (12U)
/*! SCEN_OFF
 *  0b0000..0 delay cycles
 *  0b0001..1 delay cycle
 *  0b0010..2 delay cycles
 *  0b0011..3 delay cycles
 *  0b0100..4 delay cycles
 *  0b0101..5 delay cycles
 *  0b0110..6 delay cycles
 *  0b0111..7 delay cycles
 *  0b1000..8 delay cycles
 *  0b1001..9 delay cycles
 *  0b1010..10 delay cycles
 *  0b1011..11 delay cycles
 *  0b1100..12 delay cycles
 *  0b1101..13 delay cycles
 *  0b1110..14 delay cycles
 *  0b1111..15 delay cycles
 */
#define STCU_CTRL_SCEN_OFF(x)                    (((uint32_t)(((uint32_t)(x)) << STCU_CTRL_SCEN_OFF_SHIFT)) & STCU_CTRL_SCEN_OFF_MASK)

#define STCU_CTRL_SHS_MASK                       (0x70000U)
#define STCU_CTRL_SHS_SHIFT                      (16U)
/*! SHS
 *  0b000..Shift at full rate (BIST clock).
 *  0b001..Shift at 1/2 rate (BIST clock).
 *  0b010..Shift at 1/3 rate (BIST clock).
 *  0b011..Shift at 1/4 rate (BIST clock).
 *  0b100..Shift at 1/5 rate (BIST clock).
 *  0b101..Shift at 1/6 rate (BIST clock).
 *  0b110..Shift at 1/7 rate (BIST clock).
 *  0b111..Shift at 1/8 rate (BIST clock).
 */
#define STCU_CTRL_SHS(x)                         (((uint32_t)(((uint32_t)(x)) << STCU_CTRL_SHS_SHIFT)) & STCU_CTRL_SHS_MASK)

#define STCU_CTRL_PTR_MASK                       (0x7FE00000U)
#define STCU_CTRL_PTR_SHIFT                      (21U)
#define STCU_CTRL_PTR(x)                         (((uint32_t)(((uint32_t)(x)) << STCU_CTRL_PTR_SHIFT)) & STCU_CTRL_PTR_MASK)

#define STCU_CTRL_CSM_MASK                       (0x80000000U)
#define STCU_CTRL_CSM_SHIFT                      (31U)
/*! CSM
 *  0b0..Sequential mode
 *  0b1..Concurrent mode
 */
#define STCU_CTRL_CSM(x)                         (((uint32_t)(((uint32_t)(x)) << STCU_CTRL_CSM_SHIFT)) & STCU_CTRL_CSM_MASK)
/*! @} */

/* The count of STCU_CTRL */
#define STCU_CTRL_COUNT                          (1U)

/*! @name PCS - STCU2 LBIST PC Stop */
/*! @{ */

#define STCU_PCS_PCS_MASK                        (0x3FFFFFFU)
#define STCU_PCS_PCS_SHIFT                       (0U)
/*! PCS - PCS */
#define STCU_PCS_PCS(x)                          (((uint32_t)(((uint32_t)(x)) << STCU_PCS_PCS_SHIFT)) & STCU_PCS_PCS_MASK)
/*! @} */

/* The count of STCU_PCS */
#define STCU_PCS_COUNT                           (1U)

/*! @name MISRELSW - STCU2 Online LBIST MISR Expected Low */
/*! @{ */

#define STCU_MISRELSW_MISRESWx_MASK              (0xFFFFFFFFU)
#define STCU_MISRELSW_MISRESWx_SHIFT             (0U)
#define STCU_MISRELSW_MISRESWx(x)                (((uint32_t)(((uint32_t)(x)) << STCU_MISRELSW_MISRESWx_SHIFT)) & STCU_MISRELSW_MISRESWx_MASK)
/*! @} */

/* The count of STCU_MISRELSW */
#define STCU_MISRELSW_COUNT                      (1U)

/*! @name MISREHSW - STCU2 Online LBIST MISR Expected High */
/*! @{ */

#define STCU_MISREHSW_MISRESWx_MASK              (0xFFFFFFFFU)
#define STCU_MISREHSW_MISRESWx_SHIFT             (0U)
#define STCU_MISREHSW_MISRESWx(x)                (((uint32_t)(((uint32_t)(x)) << STCU_MISREHSW_MISRESWx_SHIFT)) & STCU_MISREHSW_MISRESWx_MASK)
/*! @} */

/* The count of STCU_MISREHSW */
#define STCU_MISREHSW_COUNT                      (1U)

/*! @name MISRRLSW - STCU2 Online LBIST MISR Read Low */
/*! @{ */

#define STCU_MISRRLSW_MISRRSWx_MASK              (0xFFFFFFFFU)
#define STCU_MISRRLSW_MISRRSWx_SHIFT             (0U)
/*! MISRRSWx - MISRRSWx */
#define STCU_MISRRLSW_MISRRSWx(x)                (((uint32_t)(((uint32_t)(x)) << STCU_MISRRLSW_MISRRSWx_SHIFT)) & STCU_MISRRLSW_MISRRSWx_MASK)
/*! @} */

/* The count of STCU_MISRRLSW */
#define STCU_MISRRLSW_COUNT                      (1U)

